code-review/NRB_3471_3546/База_Было/Enums/ТипыЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЦБ</Name>
			<Comment>Типы ценных бумаг</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акция</Name>
					<Comment>Акция</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигация</Name>
					<Comment>Облигация</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вексель</Name>
					<Comment>Вексель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АДР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГДР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пай</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Золото</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарнаяРасписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлиринговыйСертификатУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Варрант</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ТипыЦБ/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает массив всех типов ЦБ, которые можно отнести к депозитарным распискам
// Возвращаемое значение:
//	- Массив
Функция ВсеТипыДепозитарныхРасписок() Экспорт
	ТипыДепозитарныхРасписок = Новый Массив;
	ТипыДепозитарныхРасписок.Добавить(Перечисления.ТипыЦБ.ДепозитарнаяРасписка);
	ТипыДепозитарныхРасписок.Добавить(Перечисления.ТипыЦБ.АДР);
	ТипыДепозитарныхРасписок.Добавить(Перечисления.ТипыЦБ.ГДР);
	
	Возврат ТипыДепозитарныхРасписок;
КонецФункции

// Возвращает Истина, если указанный тип ЦБ можно отнести к депозитарным распискам
// Параметры:
// 	ТипЦБ - ПеречислениеСсылка.ТипыЦБ
// Возвращаемое значение:
//	- Булево
Функция ЭтоДепозитарнаяРасписка(ТипЦБ) Экспорт
	ЭтоДепозитарнаяРасписка = ТипЦБ = Перечисления.ТипыЦБ.ДепозитарнаяРасписка
								Или ТипЦБ = Перечисления.ТипыЦБ.АДР
								Или ТипЦБ = Перечисления.ТипыЦБ.ГДР;
								
	Возврат ЭтоДепозитарнаяРасписка;
КонецФункции

// Возвращает массив всех типов ЦБ, у которых нет номинала
// Возвращаемое значение:
//	- Массив
Функция ТипыЦББезНоминала() Экспорт
	ТипыЦББезНоминала = ВсеТипыДепозитарныхРасписок();
	ТипыЦББезНоминала.Добавить(Перечисления.ТипыЦБ.Пай);

	Возврат ТипыЦББезНоминала;
КонецФункции

#КонецОбласти
